workloads/tsung-basic-1000-2x2-fast-killtransaction.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

<!-- Concurrent users requirement -->
<!-- System can handle 1000 simultaneous user sessions with simulated realistic loading -->

    <!-- Client side setup -->
    <clients>
        <client host="master" use_controller_vm="true" maxusers="10000" />
    </clients>

    <!-- Server side setup -->
    <servers>
        <server host="web1" port="80" type="tcp"></server>
        <server host="web2" port="80" type="tcp"></server>
    </servers>

    <monitoring>
        <!-- Monitor 2 web servers over eth1 -->
        <monitor host="monitorweb1" type="erlang"></monitor>
        <monitor host="monitorweb2" type="erlang"></monitor>

        <!-- Monitor 2 transaction servers -->
        <monitor host="monitorts1" type="erlang"></monitor>
        <monitor host="monitorts2" type="erlang"></monitor>

        <!-- Monitor database -->
        <monitor host="monitordb" type="erlang"></monitor>
    </monitoring>

    <!-- Maximum duration of entire session is 1500 seconds -->
    <load duration="30" unit="second">
        <!-- 1000 clients in total, one arriving every second -->
        <arrivalphase phase="1" duration="50" unit="second">
            <users maxnumber="1000" arrivalrate="100" unit="second"></users>
        </arrivalphase>
        <user session="killtransaction" start_time="20" unit="second"></user>
    </load>

    <sessions>
        <!-- This is simulating failure of transaction server -->
        <session name="killtransaction" probability="0" type="ts_http">
                <request subst="true">
                    <http url="/KILL" method="POST" version="1.1" contents=""></http>
                </request>
        </session>
        <!-- A simple realistic user that only buys and sells, no triggers -->
        <session name="basic" probability="100" type="ts_http">
            <!-- Just repeat indefinitely -->
            <for from="1" to="10000" var="i">

                <setdynvars sourcetype="random_string" length="10">
                    <var name="username"/>
                </setdynvars>
                <setdynvars sourcetype="random_string" length="4">
                    <var name="stock_symbol"/>
                </setdynvars>

                <request> <http url="/" method="GET" version="1.1"></http> </request>
                <thinktime value="10" random="true"></thinktime>

                <!-- Add money to account -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=ADD&amp;username=%%_username%%&amp;amount=1000&amp;submit="></http>
                </request>
                <thinktime value="10" random="true"></thinktime>

                <!-- Buy some stock -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=BUY&amp;username=%%_username%%&amp;stock_symbol=%%_stock_symbol%%&amp;amount=100&amp;submit="></http>
                </request>
                <thinktime value="5" random="true"></thinktime>

                <!-- Commit the buy -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=COMMIT_BUY&amp;username=%%_username%%&amp;submit="></http>
                </request>
                <thinktime value="10" random="true"></thinktime>

                <!-- Display summary of account -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=DISPLAY_SUMMARY&amp;username=%%_username%%&amp;submit="></http>
                </request>

                <!-- User holds on to stock for a while -->
                <thinktime value="20" random="true"></thinktime>

                <!-- Sell the stock -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=SELL&amp;username=%%_username%%&amp;stock_symbol=%%_stock_symbol%%&amp;amount=100&amp;submit="></http>
                </request>
                <thinktime value="5" random="true"></thinktime>

                <!-- Commit the sell -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=COMMIT_SELL&amp;username=%%_username%%&amp;submit="></http>
                </request>
                <thinktime value="10" random="true"></thinktime>

                <!-- Display summary of account -->
                <request subst="true">
                    <http url="/" method="POST" version="1.1" contents="action=DISPLAY_SUMMARY&amp;username=%%_username%%&amp;submit="></http>
                </request>
                <thinktime value="20" random="true"></thinktime>

            </for>
        </session>

    </sessions>
</tsung>